// Редактор текста.
// в тексте заменить пробел черточками, 
// маленькие буквы "к" заменить на большие "К",
// большие "С" заменить на маленькие "с"


string text = "- Я думаю, - сказал князь, улыбаясь, - что, "
            + "ежели бы вас послали вместо нашего милого Винценгероде,"
            + "вы бы взяли приступом согласие прусского короля."
            + "Вы так красноречивы. Вы дадите мне чаю?";

// string s = "qwerty"
//             012345
// s[3] // r

string Replace(string text, char oldValue, char newValue)
{
    string result = String.Empty;  // видео на 23 минуте
    
    int length = text.Length;
    
    return result;
}